examples/benchmarks/cohere_reranker.yaml
# BM25 → Cohere Rerank API demo on BEIR/nfcorpus
#
# Prerequisites — supply your Cohere API key via one of:
#   Option A (env var):  export COHERE_API_KEY=your-key-here
#   Option B (.env file): echo "COHERE_API_KEY=your-key" >> .env && source .env
#   Option C (inline):   uncomment and fill the api_key field below
#                        WARNING: do NOT commit this file with a real key in it
#
# Run:
#   source .env && retobs run --config examples/benchmarks/cohere_reranker.yaml
#
# Get a free Cohere API key: https://dashboard.cohere.com

experiment:
  name: "nfcorpus-bm25-cohere-rerank"

dataset:
  name: "beir/nfcorpus"
  split: "test"
  max_queries: 50

pipelines:
  - id: "bm25_cohere_rerank"
    stages:
      - type: "adapter.bm25"
        config:
          k: 100
      - type: "adapter.cohere_rerank"
        config:
          model: "rerank-english-v3.0"
          k: 10
          # api_key: "your-key-here"  # or set COHERE_API_KEY env var

metrics:
  recall_at_k: [1, 5, 10]
  ndcg_at_k: [10]
  mrr: true
  latency_percentiles: [50, 95]

execution:
  concurrency: 2
  timeout_ms: 10000

output:
  store: "sqlite"
  db_path: ".retobs/cohere_demo.db"
  export: ["json"]