examples/benchmarks/nfcorpus_rag_pipeline.yaml
# Multi-Stage RAG Pipeline Demo — NFCorpus
#
# Run: retobs run --config examples/benchmarks/nfcorpus_rag_pipeline.yaml
# Pipelines: bm25 (ablation) and bm25__rerank — stage attribution via __ prefix.

experiment:
  name: "NFCorpus: BM25 vs BM25+CrossEncoder (Multi-Stage RAG)"

dataset:
  name: beir/nfcorpus
  split: test
  max_queries: 50

stages:
  bm25:
    type: adapter.bm25
    config:
      k: 100
  rerank:
    type: adapter.hf_crossencoder
    config:
      model: cross-encoder/ms-marco-MiniLM-L-6-v2
      k: 20
      batch_size: 32

combinations:
  include:
    - [bm25, rerank]
  ablations: true

metrics:
  recall_at_k: [5, 10, 20]
  ndcg_at_k: [10, 20]
  mrr: true
  map: true
  latency_percentiles: [50, 95]

execution:
  concurrency: 2
  timeout_seconds: 120
  cache_results: true

output:
  store: sqlite
  db_path: .retobs/rag_pipeline_demo.db
  export: [json]