examples/benchmarks/nfcorpus_three_way.yaml
experiment:
  name: "nfcorpus-three-way-comparison"

dataset:
  name: "beir/nfcorpus"
  split: "test"

pipelines:
  - id: "bm25_only"
    stages:
      - type: "adapter.bm25"
        config:
          k: 100

  - id: "dense_only"
    stages:
      - type: "adapter.hf_biencoder"
        config:
          model: "sentence-transformers/all-MiniLM-L6-v2"
          k: 100
          batch_size: 64

  - id: "bm25_crossencoder"
    stages:
      - type: "adapter.bm25"
        config:
          k: 100
      - type: "adapter.hf_crossencoder"
        config:
          model: "cross-encoder/ms-marco-MiniLM-L-6-v2"
          k: 10
          batch_size: 32

metrics:
  recall_at_k: [1, 5, 10]
  ndcg_at_k: [10]
  mrr: true
  map: true
  latency_percentiles: [50, 95]

execution:
  concurrency: 4
  timeout_ms: 30000

output:
  store: "sqlite"
  db_path: ".retobs/nfcorpus_three_way.db"
  export: ["json"]