examples/benchmarks/three_stage_cascade.yaml
# three_stage_cascade.yaml
#
# Tests a 3-stage cascade reranking pipeline on BEIR/nfcorpus.
# The core question: does each added stage pay for itself?
#
#   Stage 0: BM25           — sparse retrieval, 200 candidates
#   Stage 1: fast_rerank    — small cross-encoder (22M params), cuts 200 → 50
#   Stage 2: precise_rerank — large cross-encoder (33M params), cuts 50 → 10
#
# ablations: true generates ALL valid ordered subsequences starting with bm25:
#   bm25                                       (retriever alone)
#   bm25__fast_rerank                          (cheap reranker only)
#   bm25__precise_rerank                       (expensive reranker only — skips cheap stage)
#   bm25__fast_rerank__precise_rerank          (full cascade)
#
# This answers four distinct questions in one run:
#   • Does adding fast_rerank help? (bm25 → bm25__fast_rerank)
#   • Does going straight to precise_rerank help? (bm25 → bm25__precise_rerank)
#   • Does the cascade beat the direct path? (bm25__precise_rerank vs full)
#   • Does the second stage pay for itself over the first? (bm25__fast_rerank → full)
#
# To test only whether a specific stage pays for itself, use targeted ablations:
#   ablations: [fast_rerank]   # generates only: bm25__precise_rerank, bm25__fast_rerank__precise_rerank
#
# Run with:
#   pip install -e ".[demo,dashboard,dense,dev]"
#   retobs run --config examples/three_stage_cascade.yaml --no-cache
#
# With a latency budget (prints a one-line verdict per stage pair):
#   retobs run --config examples/three_stage_cascade.yaml --no-cache --latency-budget-ms 2000

experiment:
  name: three-stage-cascade

dataset:
  type: beir
  name: beir/nfcorpus     # 323 queries, 3,633 docs — downloads automatically on first run
  split: test
  max_queries: 100         # ~2 min on CPU; remove cap for full 323-query eval

stages:
  bm25:
    type: adapter.bm25
    config:
      k: 200               # retrieve 200 candidates to give the reranker enough to work with

  fast_rerank:
    type: adapter.hf_crossencoder
    config:
      model: cross-encoder/ms-marco-MiniLM-L-6-v2   # 22M params — fast, decent quality
      k: 50                # keep top 50 to pass to the precise reranker

  precise_rerank:
    type: adapter.hf_crossencoder
    config:
      model: cross-encoder/ms-marco-MiniLM-L-12-v2  # 33M params — slower, better quality
      k: 10                # final output: top 10

combinations:
  include:
    - [bm25, fast_rerank, precise_rerank]
  ablations: true          # auto-generates [bm25] and [bm25, fast_rerank] prefix pipelines

metrics:
  recall_at_k: [5, 10, 20]
  ndcg_at_k: [10]
  mrr: true
  map: true

execution:
  concurrency: 1           # cross-encoders are CPU-bound; keep at 1 to avoid OOM
  timeout_seconds: 120     # per-query timeout across all 3 stages
  cache_results: true      # re-running reuses results unless --no-cache is passed

output:
  store: sqlite
  db_path: .retobs/three_stage_cascade.db
  export: [json]